#
# 单选题
# 请认真阅读题目然后做出解答，2分一题
#
# 3. 下列哪个不是Python中的运算符？
#
# A. *
#
# B. +
#
# C. **
#
# D. ?
# 4. 关于面向对象，以下说法错误的是
#
# A. 类就是具有相同属性和功能的一类事物
#
# B. 一个类只能有一个对象
#
# C. 定义类通过class 类名的方式，类名后面可以有括号也可以没有括号
#
# D. self就是调用该函数的对象
# 5. 以下关于异常处理的描述，正确的是
#
# A. try 语句中有 except 子句就不能有 finally 子句
#
# B. Python 中，可以用异常处理捕获程序中的任何错误
#
# C. 引发一个不存在索引的列表元素会引发 NameError 错误
#
# D. Python 中允许利用 raise 语句由程序主动引发异常
# 6. 关于if判断一下说法错误的是
#
# A. elif必须和if一起使用
#
# B. else一般用在最后，即所有条件都不满足时使用
#
# C. else可以有也可以没有
#
# D. if后面有括号
# 7. 设 str = ‘python’，想把字符串的第一个字母大写，其他字母还是小写，正确的选项是
#
# A. print(str[0].upper()+str[1:])
#
# B. print(str[1].upper()+str[-1:1])
#
# C. print(str[0].upper()+str[1:-1])
#
# D. print(str[1].upper()+str[2:])
# 8. 以下哪种不是创建集合的方式？
#
# A. s = {}
#
# B. s = set()
#
# C. s = {1, 2, 3}
#
# D. s = {('a', 'b') , 'c'}
# 9. 调用open函数可以打开指定文件，在open()函数中访问模式参数使用()表示只读：
#
# A. a
#
# B. w+
#
# C. r
#
# D. w
# 10. 以下关于模块说法错误的是:
#
# A. 一个xx.py就是一个模块
#
# B. 任何一个普通的xx.py文件可以作为模块导入
#
# C. 运行时会从制定的目录搜索导入的模块，如果没有，会报错异常
#
# D. 模块文件的扩展名不一定是 .py
# 11. 以下是字符转换成字节的方法是
#
# A. decode()
#
# B. encode()
#
# C. upper()
#
# D. rstrip()
# 12. 以下不属于python里面的保留关键字的是
#
# A. while
#
# B. continue
#
# C. goto
#
# D. for
# 多选题
# 请认真阅读题目然后做出解答，多选少选错选不得分，3分一题
#
# 13. 下列说法正确的是
#
# A. 在函数内部没有任何生命的情况下直接为某个变量赋值，这个变量一定是函数内部的变量
#
# B. 在python中定义函数时，不需要声明函数参数的类型
#
# C. 在python中定义函数时，不需要声明函数的返回值类型
#
# D. 在函数中没有任何办法可以通过形参来影响实参的值
# 14. 打开文件的正确写法有?
#
# A. f = open('C:\App\test.txt' ,'r')
#
# B. with open('test.txt') as f:
#
# C. f = open(r'C:\App\test.txt')
#
# D. f = open('C:\App\test.txt')
# 15. 以下哪些是可迭代对象（）
#
# A.123
#
# B.'abc'
#
# C.[1,2,3]
#
# D.False
# 16. 以下关于Python循环结构的描述中，说法正确的是?
#
# A. continue只结束本次循环。
#
# B.遍历循环中的遍历结构可以是字符串、文件、组合数据类型和range()函数等。
#
# Python通过for、while等关键字构建循环结构。
#
# break用来结束当前当此循环，但不跳出当前的循环体。
# 17. python的join方法用于将序列中的元素以指定的字符连接生成一个新的字符串，那么下列选中中正确的是
#
# A. 语句''.join('a','b')是合法的
#
# B. 语句''.join(['a','b'])是合法的
#
# C. 语句''.join([1,2,3])是合法的
#
# D. 语句''.join(['1','2','3'])是合法的
# 18. 如果要自定义实现一个迭代器，则类中必须实现哪些方法
#
# A. 实现iter()方法
#
# B. 实现init()方法
#
# C. 实现new()方法
#
# D. 实现next()方法
# 19. 下列说法错误的是：（）
#
# A.变量无须先创建和赋值即可直接使用
#
# B.变量不必事先声明
#
# C.变量必须指定类型
#
# D.变量名不能用数字开头
# 20. 在列表中添加元素的方法有哪些？
#
# A. append()
#
# B. insert()
#
# C. tuple()
#
# D.add()
# 21. 在python中，函数参数支持的类型有
#
# A. 位置参数
#
# B. 默认值参数
#
# C. 关键参数
#
# D. 可变长度参数
# 22. 关于协程，下列说法错误的是：
#
# A. 协程是完全独立的，不依赖于进程和线程。
#
# B. 协程占用资源最小，效率较高。
#
# C. yield可以将程序暂停，并保持中断的状态。
#
# D. gevent通过设置switch()来实现任意函数之间的切换。